<a href="https://colab.research.google.com/github/GayeonKim-data/ds-admission-challenge/blob/master/ds_bootcamp_admission_challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Challenge

- 코드스테이츠 DS 부트캠프 어드미션을 위한 Challenge 과제 입니다. 
- 아래 challenge 를 풀기 위해 제공된 강의가 모든 것을 알려주진 않습니다. 
- 따라서 필요한 부분은 스스로 google 검색을 통해 이 challenge 를 완성해 주셔야 합니다. 
- 각 shell 에 필요한 부분을 작성하신 후 함께 링크를 제출해 주시면 됩니다.
- 모든 결과물은 하나의 shell에서 모두 실행될 수 있도록 print문을 사용해 주세요. run all 했을 때 전체 shell 이 모두 잘 실행될 수 있도록 관리해 주세요.

In [1]:
# 1. 다음의 list 에서 두 번째 list elemnet 를 print 해 보세요
list_01 = ['Paul', 'John', 'Ringo', 'George']

list_01[1]
# python에서 index는 0부터 시작하므로 두 번째 list element를 출력한다는 건 index가 1인 것을 출력하는 것이다.

'John'

In [5]:
# 2. 다음의 list in the list에서 두 번째 element 를 print 해 보세요
list_02 = [['Paul', 'John', 'Ringo', 'George']]

print(list_02[0][1])
# list in the list 구조이므로, 문제를 해결하기 위해서는 첫 번째 리스트(index == 0)에서 두 번째 element(index == 1)를 출력해야 한다.

John

In [8]:
# Initializing list  
list_01 = [ 1, 6, 3, 5, 3, 4 ] 
list_02 = [ 1, 6, 3, 5, 3 ] 

# for loop을 이용하여 두 개의 리스트 안에 4가 있는지 없는지 print 하는 코드를 작성하세요 (range 사용해서 풀어보기 + count)

# list_01 확인
counter_01 = 0
for i in range(len(list_01)):

  # list_01의 i(0부터 시작)번째 element가 4라면 counter_01에 1을 더한다. (개수 누적하기 위함)
  if list_01[i] == 4:
    counter_01 += 1

# counter_01의 값이 0이면 4가 없고, 0이 아니라면 4가 counter_01의 값 만큼 있다.
if counter_01 == 0:
  print("list_01에는 4가 없습니다.")
else:  
  print("list_01에는 4가 {}개 있습니다.".format(counter_01))


# list_02 확인 (위와 동일)
counter_02 = 0
for i in range(len(list_02)):
  if list_02[i] == 4:
    counter_02 += 1
if counter_02 == 0:
  print("list_02에는 4가 없습니다.")
else:  
  print("list_02에는 4가 {}개 있습니다.".format(counter_02))

list_01에는 4가 1개 있습니다.
list_02에는 4가 없습니다.

In [59]:
# 위 코드 역할을 하는 함수를 작성해 보세요.

def check_num(num, input_list): # 4가 아닌 다른 숫자도 찾을 수 있도록 찾고자 하는 수도 파라미터로 만들었다.
  counter = 0
  for i in range(len(input_list)):
    if input_list[i] == num:
      counter += 1
  if counter == 0:
    print("해당 list에는 {}가 없습니다.".format(num))
  else:  
    print("해당 list에는 {}가 {}개 있습니다.".format(num, counter))


# 확인
check_num(4, list_01)
check_num(4, list_02)
check_num(3, list_02)

해당 list에는 4가 1개 있습니다.
해당 list에는 4가 없습니다.
해당 list에는 3가 2개 있습니다.

In [60]:
list_03 = [4, 5, 8, 9, 10] 
# 위 list element 중 8보다 큰 숫자가 몇 개가 있는지 코드로 작성해 보세요. (for문 안 쓰고 해보기)

# 방법 1: list comprehension
result_01 = [n for n in list_03 if n > 8] # list_03에서 8보다 큰 것만 result_01에 넣는다.
r1 = len(result_01)
print("8보다 큰 숫자가 {}개 있습니다.".format(r1))

# 방법 2: numpy 사용
import numpy as np
array_02 = np.array(list_03)
r2 = len(array_02[array_02 > 8])
print("8보다 큰 숫자가 {}개 있습니다.".format(r2))

8보다 큰 숫자가 2개 있습니다.
8보다 큰 숫자가 2개 있습니다.

In [30]:
# BMI
height = [1.87,  1.87, 1.82, 1.91, 1.90, 1.85]
weight = [81.65, 97.52, 95.25, 92.98, 86.18, 88.45]

# bmi = weight / height ** 2 를 numpy array 활용하여 구해보세요

# numpy array 생성
np_height = np.array(height)
np_weight = np.array(weight)

# bmi를 numpy array로 생성
bmi = np_weight / np_height ** 2
print(bmi)


# bmi 가 24 이상인 값들만 선택해 보세요
print(bmi[bmi >= 24])

[23.34925219 27.88755755 28.75558507 25.48723993 23.87257618 25.84368152]
[27.88755755 28.75558507 25.48723993 25.84368152]

In [32]:
# pandas 패키지 라이브러리를 불러오세요
import pandas as pd

# 아래 내용을 담는 pandas Dataframe 을 생성하세요
# {'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']}

df = pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 'Sue': ['Pretty good.', 'Bland.']})
df

             Bob           Sue
0    I liked it.  Pretty good.
1  It was awful.        Bland.

In [61]:
# 아래와 같은 dataframe을 만들어 보세요. (참고: 연도가 index가 되게 해 주세요)
"""
year dept     revenue
2015 Sales    30
2016 Sales    35
2017 Sales    40
"""

# DataFrame을 만들기 위한 data 생성
datas = [
    {"year":2015, "dept":"Sales", "revenue":30},
    {"year":2016, "dept":"Sales", "revenue":35},
    {"year":2017, "dept":"Sales", "revenue":40}
]

result_df = pd.DataFrame(datas) # DataFrame 생성
result_df.set_index("year", inplace=True) # year로 index 변경
print(result_df)

print()

# 2017년 데이터만 선택해 보세요
print(result_df.loc[2017]) # df.loc[label]

print()

# 조건(condition)을 활용하여 revenue 30 이상으로만 filter 해 보세요. reference: https://pandas.pydata.org/pandas-docs/stable/getting_started/intro_tutorials/03_subset_data.html 
print(result_df[result_df["revenue"] >=30])

       dept  revenue
year
2015  Sales       30
2016  Sales       35
2017  Sales       40

dept       Sales
revenue       40
Name: 2017, dtype: object

       dept  revenue
year
2015  Sales       30
2016  Sales       35
2017  Sales       40

In [45]:
# 'https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv' 자료를 불러와 dataframe으로 만들어 보세요 
titanic_df = pd.read_csv('https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv')
titanic_df.tail()

     Survived  Pclass  ... Parents/Children Aboard   Fare
882         0       2  ...                       0  13.00
883         1       1  ...                       0  30.00
884         0       3  ...                       2  23.45
885         1       1  ...                       0  30.00
886         0       3  ...                       0   7.75

[5 rows x 8 columns]

In [65]:
# 타이타닉 데이터의 shape은 어떻게 되나요? 
print(titanic_df.shape) # 출력 결과: (row, column)

# 타이타닉 row record에서 10~20번째 줄을 출력해 보세요.
print(titanic_df[9:20])  # index가 0부터 시작하므로 10~20번째 줄을 출력하기 위해서는 index가 9~19인 row를 출력하면 된다.

# 타이타닉 데이터에서 'Survived', 'Age', 'Sex' 칼럼 데이터를 선택해 보세요
print(titanic_df[["Survived", "Age", "Sex"]]) # df[[]]

# 타이타닉 데이터에서 생존자 데이터만 골라보세요
surv = titanic_df[titanic_df["Survived"] == 1] # 뒤의 문제에서도 사용할 것이기 때문에 결과를 DataFrame으로 따로 만들어주었다.
print(surv)

# 생존자 데이터 중 여자, 남자 중 누가 더 많나요? 참고: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html
# 개수 세기
result_df = surv["Sex"].value_counts()
print(result_df)

# 생존자 수 비교하기
male_num = result_df["male"]
female_num = result_df["female"]

if male_num > female_num:
  print("생존자 수는 남자가 더 많다.")
elif female_num > male_num:
  print("생존자 수는 여자가 더 많다.")
else:
  print("생존자 수는 남자와 여자가 같다.")

(887, 8)
    Survived  Pclass  ... Parents/Children Aboard     Fare
9          1       2  ...                       0  30.0708
10         1       3  ...                       1  16.7000
11         1       1  ...                       0  26.5500
12         0       3  ...                       0   8.0500
13         0       3  ...                       5  31.2750
14         0       3  ...                       0   7.8542
15         1       2  ...                       0  16.0000
16         0       3  ...                       1  29.1250
17         1       2  ...                       0  13.0000
18         0       3  ...                       0  18.0000
19         1       3  ...                       0   7.2250

[11 rows x 8 columns]
     Survived   Age     Sex
0           0  22.0    male
1           1  38.0  female
2           1  26.0  female
3           1  35.0  female
4           0  35.0    male
..        ...   ...     ...
882         0  27.0    male
883         1  19.0  female
884         0   7.0  female
885         1  26.0    male
886         0  32.0    male

[887 rows x 3 columns]
     Survived  Pclass  ... Parents/Children Aboard     Fare
1           1       1  ...                       0  71.2833
2           1       3  ...                       0   7.9250
3           1       1  ...                       0  53.1000
8           1       3  ...                       2  11.1333
9           1       2  ...                       0  30.0708
..        ...     ...  ...                     ...      ...
871         1       3  ...                       0   7.2250
875         1       1  ...                       1  83.1583
876         1       2  ...                       1  26.0000
883         1       1  ...                       0  30.0000
885         1       1  ...                       0  30.0000

[342 rows x 8 columns]
female    233
male      109
Name: Sex, dtype: int64
생존자 수는 여자가 더 많다.